app/jobs/trips/calculate_average_rating_job.rb

  def perform
    avg_rating = Trip.average(:rating)
    trips_count = Trip.count
---
SELECT AVG("trips"."rating") FROM "trips"
SELECT COUNT(*) FROM "trips"