app/controllers/api/v1/trips_controller.rb

SELECT "trips".* FROM "trips" WHERE (name ILIKE '%Cadillac%' OR short_description ILIKE '%Cadillac%' OR long_description ILIKE '%Cadillac%') ORDER BY name asc LIMIT 10 OFFSET 0
---
      def index
        payload = Rails.cache.fetch(index_page_cache_key, expires_in: 1.minute) do
          result = TripsQuery.new(Trip.all, params).call

          {
            data: result[:trips].map { |trip| TripSummarySerializer.serialize(trip) },
            meta: result[:pagination]

SELECT "trips".* FROM "trips" WHERE "trips"."id" = 999 LIMIT 1
---
      def show
        trip = Trip.find(params[:id])

INSERT INTO "trips" ("name", "image_url", "short_description", "long_description", "rating", "created_at", "updated_at") VALUES ('Santorini', 'https://example.com/santorini.jpg', 'Greek island', 'White houses, blue domes, sunsets.', 5, '2026-03-22 20:44:15.617864', '2026-03-22 20:44:15.617864') RETURNING "id"
---
      def create
        trip = Trip.new(trip_params)

        if trip.save